Catalogs/ПрофилиНастроекЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПрофилиНастроекЭДО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПассивноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсВходящихДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОферты</Name>
					<Comment>Двоичные данные подписанного файла оферты</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонТекстаПриглашений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочтаДляУведомлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМестонахожденияОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СертификатыПодписейОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СертификатыЭЦП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКонтейнера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерсияФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьЭЦП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийДокумент</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяИзвещениеОПолучении</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОтветнаяПодпись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СертификатыЭЦП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>СертификатыЭЦП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоСертификату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапомнитьПарольКСертификату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничитьДоступКСертификату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещенОСрокеДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отозван</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСоставИсполнителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлСертификата</Name>
					<Comment>Двоичные данные сертификата</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>alias</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>serialNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>disk</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>path</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>file_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>plugin</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьДляПодписи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставИсполнителей</Name>
					<Comment>Список пользователей, после утверждения или подписания которых, документ переходит на подпись по данному сертификату</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Comment>Пользователь или группа пользователей</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПользователей</Name>
					<Comment>Список пользователей, которым доступен сертификат. (если список пустой сертификат доступен всем пользователям)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Пользователь или группа пользователей</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПрофилиНастроекЭДО/Forms/ПомощникПодключенияЭДО/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	
	Макет = Справочники.ПрофилиНастроекЭДО.ПолучитьМакет("ТекстОферты82");
	// Проверка версии конфигурации
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсия = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрокЭД(СистемнаяИнформация.ВерсияПриложения, ".");
	Если ТекущаяВерсия[1] = "3" Тогда
		Макет = Справочники.ПрофилиНастроекЭДО.ПолучитьМакет("ТекстОферты83");
	КонецЕсли;
	ДокументHTML = Макет.ПолучитьДокументHTML();
	
	СтруктураВложений = Новый Структура;
	Для Каждого Картинка Из ДокументHTML.Картинки Цикл
		СтруктураВложений.Вставить(Картинка.Имя, Картинка); 
	КонецЦикла;
	
	ТекстОферты.УстановитьHTML(Макет.ПолучитьТекст(), СтруктураВложений);
	
	УстановитьЗначенияПоУмолчанию();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаПодключенияКVenkonЭДО;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	// Задаем вопрос только в случае досрочного закрытия помощника.
	Если Не ЗначениеЗаполнено(СсылкаНаПрофильНастроек) Тогда
		
		ТекстВопроса = НСтр("ru = 'Введенные данные не будут сохранены.
							|Прервать работу помощника?'");
							
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтаФорма, ЭтаФорма);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
	Иначе
		ПередЗакрытиемЗавершение(КодВозвратаДиалога.Да, ЭтаФорма);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Форма) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Отказ = Истина;
	КонецЕсли;
		
	Если Не Отказ И ЭтоАдресВременногоХранилища(АдресВременногоХранилища) Тогда
		УдалитьИзВременногоХранилища(АдресВременногоХранилища);
	КонецЕсли;
	
	Форма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
		
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	ИспользоватьЭП = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьЗначениеФункциональнойОпции("ИспользоватьЭлектронныеЦифровыеПодписи");
	СертификатКриптографии = Справочники.СертификатыЭЦП.ПустаяСсылка();
	
	Если ИспользоватьЭП Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СертификатыЭЦП.Ссылка
		|ИЗ
		|	Справочник.СертификатыЭЦП КАК СертификатыЭЦП
		|ГДЕ
		|	СертификатыЭЦП.Организация = &Организация
		|	И НЕ СертификатыЭЦП.ПометкаУдаления
		|	И НЕ СертификатыЭЦП.Отозван";
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
			СертификатКриптографии = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	ЗначениеФОИспользоватьЭП = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьЗначениеФункциональнойОпции("ИспользоватьЭлектронныеЦифровыеПодписи");
	Элементы.ГруппаВыбораСертификатаЭПЧерезЭДО.Видимость = ЗначениеФОИспользоватьЭП;
	
	Элементы.Далее.Доступность = Форма.СОфертойОзнакомлен;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодсказкуПоЭП(Команда)
	
	ОткрытьФорму("Справочник.ПрофилиНастроекЭДО.Форма.ФормаПодсказкиПоЭП");
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеСОфертойПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ОчиститьСообщения();
	
	Если ИспользоватьЭП Тогда
		Если СертификатКриптографии.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан сертификат ЭЦП!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(Пароль) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДалееПроверитьГотовностьСистемы", ЭтаФорма);
		ТекстВопроса = "Не заполнено поле ""Пароль"". Он будет сгенерирован автоматически. Продолжить?";
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да);
		
	Иначе
		ДалееПроверитьГотовностьСистемы(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДалееПроверитьГотовностьСистемы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаФоновая;
	Элементы.Готово.Доступность 	= Ложь;
	Элементы.Назад.Доступность 		= Ложь;
	Элементы.Декорация5.Заголовок 	= "";
	Элементы.КартинкаПроверкиКомпоненты.Картинка 	= БиблиотекаКартинок.ВосклицательныйЗнакКрасный;
	Элементы.КартинкаПодключенияКЭДО.Картинка 		= БиблиотекаКартинок.ВосклицательныйЗнакКрасный;
	Элементы.Декорация2.Видимость = Истина;
	
	ПодключитьОбработчикОжидания("ДалееПроверитьПодключениеКомпонентыDIDOX", 0.1, Истина); 
		
КонецПроцедуры

&НаКлиенте
Процедура ДалееПроверитьПодключениеКомпонентыDIDOX()
	
	Элементы.КартинкаПроверкиКомпоненты.Картинка 	= БиблиотекаКартинок.Сформировать;
	
	СтатусПодключенияDLL = ОбработчикиDidoxEImzo.ПроверитьРегистрациюКомпонентыЭО();
	Если СтатусПодключенияDLL = 0 Тогда
		ОбработчикиDidoxEImzoСервер.ПодключитьФайлКомпонентыVenkonЭДО(СтатусПодключенияDLL);
	КонецЕсли;
	
	Если СтатусПодключенияDLL <> 2 Тогда
		
		ТекстЗаголовка = "Возникли ошибки при прооверки подключения компоненты Didox. Статус подключения DLL = " + СтатусПодключенияDLL;
		ДействияПриОшибкеПодключения(ТекстЗаголовка);
		
		Элементы.КартинкаПроверкиКомпоненты.Картинка = БиблиотекаКартинок.Ошибка32;
		Возврат;
		
	Иначе
		
		Элементы.КартинкаПроверкиКомпоненты.Картинка = БиблиотекаКартинок.СинхронизацияДанныхДанныеПолучены;
		
	КонецЕсли;

	ПодключитьОбработчикОжидания("ДалееЗарегистрироватьПрофильНаСервереDIDOX", 0.1, Истина); 
		
КонецПроцедуры

&НаКлиенте
Процедура ДалееЗарегистрироватьПрофильНаСервереDIDOX()
	
	Элементы.КартинкаПодключенияКЭДО.Картинка = БиблиотекаКартинок.Сформировать;
	
	Если ТестПрофиляНастроекЭДО() И СтатусПодключенияDLL = 2 Тогда
		
		// Подписываем оферту
		ДвоичныеДанныеОферты = ПолучитьДвоичныеДанныеОфертыНаСервере();
		ПодписаннаяСтрока = ЭлектронныеДокументыСлужебныйКлиент.venkonПодписатьСтроку(ДвоичныеДанныеОферты, СертификатКриптографии); 
		Если ПодписаннаяСтрока = Неопределено ИЛИ ПодписаннаяСтрока = "" Тогда
			ДалееЗавершение();
			Возврат;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Организация);
		СтруктураПараметров.Вставить("Пароль", Пароль);
		СтруктураПараметров.Вставить("СертификатКриптографии", СертификатКриптографии);
		СтруктураПараметров.Вставить("СтруктураОтветаСервера", СтруктураОтветаСервера);
		СтруктураПараметров.Вставить("ФайлОферты", ПодписаннаяСтрока);
		
		СоздатьНовыйПрофиль(СтруктураПараметров);
		ПодключитьОбработчикОжидания("ДалееЗавершение", 0.1, Истина); 
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДалееЗавершение()
	
	СтруктураОтветаСервера = Неопределено;
	Если ЭтоАдресВременногоХранилища(АдресВременногоХранилища) Тогда
		СтруктураОтветаСервера = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	КонецЕсли;
				
	Если ТипЗнч(СтруктураОтветаСервера) = Тип("Структура") И СтруктураОтветаСервера.Подключено Тогда
		
		СтруктураОтветаСервера.Свойство("ПрофильНастроекЭДО", СсылкаНаПрофильНастроек);
		
		ДействияПриУспешномПодключении("Подключение успешно выполнено!");
		
		Элементы.КартинкаПодключенияКЭДО.Картинка = БиблиотекаКартинок.СинхронизацияДанныхДанныеПолучены;
		
	Иначе
		
		Если ТипЗнч(СтруктураОтветаСервера) = Тип("Структура") Тогда		
			
			Если Не ПустаяСтрока(СтруктураОтветаСервера.СообщитьПользователю) Тогда
				Ошибки = Неопределено;
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Организация", СтруктураОтветаСервера.СообщитьПользователю);
				Для Каждого ТекстОшибки Из СтруктураОтветаСервера.Ошибки Цикл
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Организация", ТекстОшибки);
				КонецЦикла;
				ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
			КонецЕсли;
			
			ДействияПриОшибкеПодключения(СтруктураОтветаСервера.СообщитьПользователю);
			
		Иначе
			ДействияПриОшибкеПодключения();
		КонецЕсли;
		
		Элементы.КартинкаПодключенияКЭДО.Картинка = БиблиотекаКартинок.Ошибка32;
				
	КонецЕсли;
	
	Оповестить("ОбновитьСостояниеЭД");
		
КонецПроцедуры

&НаСервере
Процедура СоздатьНовыйПрофиль(СтруктураПараметров)
	
	СсылкаНаПрофильНастроек = Справочники.ПрофилиНастроекЭДО.СоздатьНовыйПрофильНастроекЭДО(СтруктураПараметров, АдресВременногоХранилища, УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция ТестПрофиляНастроекЭДО()
	
	Отказ = Ложь;
	// Тестируем заполненность формы
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Организация"),
			,
			"Организация",
			,
			Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Назад(Команда)
	
	Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницаПодключенияКVenkonЭДО;
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	ПоказатьЗначение(, СсылкаНаПрофильНастроек);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриОшибкеПодключения(ТекстЗаголовка = "")
	
	Элементы.Назад.Доступность 		= Истина;
	Элементы.Готово.Доступность 	= Ложь;
	
	Элементы.Декорация2.Видимость 	= Ложь;
	
	Если ПустаяСтрока(ТекстЗаголовка) Тогда
		ЗаголовокПодключения = "Возникли ошибки во время регистрации нового профиля ЭДО!";
	Иначе
		ЗаголовокПодключения = ТекстЗаголовка;
	КонецЕсли;
	
	Элементы.Декорация5.Заголовок 	= ЗаголовокПодключения;
	Элементы.Декорация5.ЦветТекста 	= Новый Цвет(255, 0, 0);

КонецПроцедуры

&НаКлиенте
Процедура ДействияПриУспешномПодключении(ТекстЗаголовка = "")
	
	Элементы.Назад.Доступность 		= Ложь;
	Элементы.Готово.Доступность 	= Истина;
	
	Элементы.Декорация2.Видимость 	= Ложь;
	
	Если ПустаяСтрока(ТекстЗаголовка) Тогда
		ЗаголовокПодключения = "Подключение успешно выполнено!";
	Иначе
		ЗаголовокПодключения = ТекстЗаголовка;
	КонецЕсли;
	
	Элементы.Декорация5.Заголовок 	= ЗаголовокПодключения;
	Элементы.Декорация5.ЦветТекста 	= Новый Цвет(50, 205, 50);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СгенерироватьПарольНаСервере(ДлинаПароля = 20)
	Возврат Справочники.ПрофилиНастроекЭДО.СгенерироватьНовыйПароль(ДлинаПароля);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеОфертыНаСервере()
	
	Возврат Справочники.ПрофилиНастроекЭДО.ПолучитьДвоичныеДанныеОферты();
	
КонецФункции

&НаКлиенте
Процедура СгенерироватьПароль(Команда)
	Пароль = СгенерироватьПарольНаСервере();
КонецПроцедуры
